released/M480BSP_FreeRTOS_Queue_UART_Rx/SampleCode/Template/main.c
/*_____ I N C L U D E S ____________________________________________________*/
#include <stdio.h>
#include <string.h>
#include "NuMicro.h"

/* Kernel includes. */
#include "FreeRTOS.h"
#include "task.h"
#include "Queue.h"
#include "timers.h"
#include "semphr.h"
#include "stream_buffer.h"
#include "cpu_utils.h"


#include "project_config.h"

/*_____ D E C L A R A T I O N S ____________________________________________*/

// #define printf(...)	\
// {	\
// 	vTaskSuspendAll();	\
// 	printf(__VA_ARGS__);	\
// 	fflush(stdout); \
// 	xTaskResumeAll();	\
// }	\

#define mainNORMAL_TASK_PRIORITY           	( tskIDLE_PRIORITY + 0UL )
#define mainABOVENORMAL_TASK_PRIORITY     	( mainNORMAL_TASK_PRIORITY + 1UL )

#define mainCHECK_TASK_PRIORITY             ( mainNORMAL_TASK_PRIORITY + 3UL )

QueueHandle_t xUARTQueue_timeout; 
QueueHandle_t xUARTQueue_scatter; 
StreamBufferHandle_t xStreamBuffer_timeout;
StreamBufferHandle_t xStreamBuffer_scatter;

unsigned int sRxCount = 0;


/*_____ D E F I N I T I O N S ______________________________________________*/
volatile uint32_t BitFlag = 0;
volatile uint32_t counter_tick = 0;

#define UART1_RX_DMA_CH 		            (0)
#define UART2_RX_DMA_CH 		            (1)
#define UART_PDMA_OPENED_CH   	            ((1 << UART1_RX_DMA_CH) | (1 << UART2_RX_DMA_CH))

#define UART1_PDMA_OPENED_CH_RX   	        (1 << UART1_RX_DMA_CH)
#define UART2_PDMA_OPENED_CH_RX   	        (1 << UART2_RX_DMA_CH)

#define PDMA_TIME                           (0x100)
#define RXBUFSIZE                           (32)

#define PDMA_GET_TRANS_CNT(pdma,u32Ch)      ((uint32_t)((pdma->DSCT[(u32Ch)].CTL&PDMA_DSCT_CTL_TXCNT_Msk) >> PDMA_DSCT_CTL_TXCNT_Pos))

#define ENABLE_UART1
// #define ENABLE_UART2

// #define ENABLE_PDMA_TIMEOUT
#define ENABLE_PDMA_SCATTER

#if defined (ENABLE_PDMA_TIMEOUT)
#define PDMA_TIMEOUT_IRQHandler            PDMA_IRQHandler

uint8_t UART1_RxBuffer[RXBUFSIZE] = {0};
uint8_t UART2_RxBuffer[RXBUFSIZE] = {0};

#elif defined (ENABLE_PDMA_SCATTER)
#define PDMA_SCATTER_IRQHandler            PDMA_IRQHandler

enum
{
    UART1_RX_BUFFER01 = 0,
    UART1_RX_BUFFER02,

    UART2_RX_BUFFER01 = 0,
    UART2_RX_BUFFER02,    
};

typedef struct DMA_DESC_t
{
    uint32_t ctl;
    uint32_t src;
    uint32_t dest;
    uint32_t offset;
} DMA_DESC_t;

DMA_DESC_t DMA_UART1DESC[2];
DMA_DESC_t DMA_UART2DESC[2];

typedef struct UART_packet_T
{
    uint8_t g_u8RecData[RXBUFSIZE];
    uint32_t g_u32comRbytes;
    uint32_t g_u32comRhead;
    uint32_t g_u32comRtail;
    uint32_t g_u32cntbak;    
    uint32_t g_u8PackageComplete;
    uint16_t tmp; 
    uint32_t cnt;     
} UART_packet_T;
UART_packet_T UART1_P =  
{
    {0} ,   //g_u8RecData[RXBUFSIZE]
    0,
    0,
    0,
    RXBUFSIZE / 2 - 1,  //g_u32cntbak
    0,
    0,
    0
};

UART_packet_T UART2_P =  
{
    {0} ,   //g_u8RecData[RXBUFSIZE]
    0,
    0,
    0,
    RXBUFSIZE / 2 - 1,  //g_u32cntbak
    0,
    0,
    0
};

#endif


/*_____ M A C R O S ________________________________________________________*/
#define DELAY_MS					        (1)

/*_____ F U N C T I O N S __________________________________________________*/

void tick_counter(void)
{
	counter_tick++;
}

uint32_t get_tick(void)
{
	return (counter_tick);
}

void set_tick(uint32_t t)
{
	counter_tick = t;
}

void compare_buffer(uint8_t *src, uint8_t *des, int nBytes)
{
    uint16_t i = 0;	
	
    for (i = 0; i < nBytes; i++)
    {
        if (src[i] != des[i])
        {
            printf("error idx : %4d : 0x%2X , 0x%2X\r\n", i , src[i],des[i]);
			set_flag(flag_error , ENABLE);
        }
    }

	if (!is_flag_set(flag_error))
	{
    	printf("%s finish \r\n" , __FUNCTION__);	
		set_flag(flag_error , DISABLE);
	}

}

void reset_buffer(void *dest, unsigned int val, unsigned int size)
{
    uint8_t *pu8Dest;
//    unsigned int i;
    
    pu8Dest = (uint8_t *)dest;

	#if 1
	while (size-- > 0)
		*pu8Dest++ = val;
	#else
	memset(pu8Dest, val, size * (sizeof(pu8Dest[0]) ));
	#endif
	
}

void copy_buffer(void *dest, void *src, unsigned int size)
{
    uint8_t *pu8Src, *pu8Dest;
    unsigned int i;
    
    pu8Dest = (uint8_t *)dest;
    pu8Src  = (uint8_t *)src;


	#if 0
	  while (size--)
	    *pu8Dest++ = *pu8Src++;
	#else
    for (i = 0; i < size; i++)
        pu8Dest[i] = pu8Src[i];
	#endif
}

void dump_buffer(uint8_t *pucBuff, int nBytes)
{
    uint16_t i = 0;
    
    printf("dump_buffer : %2d\r\n" , nBytes);    
    for (i = 0 ; i < nBytes ; i++)
    {
        printf("0x%2X," , pucBuff[i]);
        if ((i+1)%8 ==0)
        {
            printf("\r\n");
        }            
    }
    printf("\r\n\r\n");
}

void dump_buffer_hex(uint8_t *pucBuff, int nBytes)
{
    int     nIdx, i;

    nIdx = 0;
    while (nBytes > 0)
    {
        printf("0x%04X  ", nIdx);
        for (i = 0; i < 16; i++)
            printf("%02X ", pucBuff[nIdx + i]);
        printf("  ");
        for (i = 0; i < 16; i++)
        {
            if ((pucBuff[nIdx + i] >= 0x20) && (pucBuff[nIdx + i] < 127))
            {
                printf("%c", pucBuff[nIdx + i]);
            }
            else
            {
                printf(".");
            }
            nBytes--;
        }
        nIdx += 16;
        printf("\n");
    }
    printf("\n");
}

void StreamBufferInISR(StreamBufferHandle_t xStreamBuffer, uint8_t* RxIn ,size_t xDataLengthBytes)
{
    portBASE_TYPE xHigherPriorityTaskWoken = pdFALSE;    
    BaseType_t xResult;    

    xResult = xStreamBufferSendFromISR( xStreamBuffer, RxIn , xDataLengthBytes, &xHigherPriorityTaskWoken );

    /* Was the message posted successfully? */
    if( xResult != pdFAIL ) {
        /* If xHigherPriorityTaskWoken is now set to pdTRUE then a context
        switch should be requested.  The macro used is port specific and will
        be either portYIELD_FROM_ISR() or portEND_SWITCHING_ISR() - refer to
        the documentation page for the port being used. */
        portYIELD_FROM_ISR( xHigherPriorityTaskWoken );
    }
}

void QueueSingleInISR(QueueHandle_t xQueue, uint8_t tag)
{
    portBASE_TYPE xHigherPriorityTaskWoken = pdFALSE;    
    BaseType_t xResult;    
    uint8_t xData = tag;

