released/M480BSP_FreeRTOS_Queue_UART_Rx/SampleCode/Template/main.c
    xResult = xQueueSendFromISR( xQueue, &xData, &xHigherPriorityTaskWoken );   
    printf("Queue ISR:0x%2X ,tag:0x%2X\r\n" , xResult , xData);        

    /* Was the message posted successfully? */
    if( xResult != pdFAIL ) {
    /* If xHigherPriorityTaskWoken is now set to pdTRUE then a context
    switch should be requested.  The macro used is port specific and will
    be either portYIELD_FROM_ISR() or portEND_SWITCHING_ISR() - refer to
    the documentation page for the port being used. */
    portYIELD_FROM_ISR( xHigherPriorityTaskWoken );
    }
}

#if defined (ENABLE_PDMA_SCATTER)

void PDMA_SCATTER_IRQHandler(void)
{
    uint32_t status = PDMA_GET_INT_STATUS(PDMA);
    uint8_t len = 0;

    #if defined (ENABLE_UART1) 
    UART1_P.cnt = PDMA_GET_TRANS_CNT(PDMA, UART1_RX_DMA_CH); /* channel transfer count */
    #endif

    #if defined (ENABLE_UART2) 
    UART2_P.cnt = PDMA_GET_TRANS_CNT(PDMA, UART2_RX_DMA_CH); /* channel transfer count */
    #endif

    if (status & PDMA_INTSTS_ABTIF_Msk)   /* abort */
    {
        printf("target abort interrupt !!:\r\n");
		#if 0
        PDMA_CLR_ABORT_FLAG(PDMA, PDMA_GET_ABORT_STS(PDMA));
		#else

        #if defined (ENABLE_UART1)            
        if (PDMA_GET_ABORT_STS(PDMA) & (UART1_PDMA_OPENED_CH_RX))
        {
            printf("UART1_PDMA_OPENED_CH_RX\r\n");
            PDMA_CLR_ABORT_FLAG(PDMA, (UART1_PDMA_OPENED_CH_RX));
        }
        #endif
        
        #if defined (ENABLE_UART2) 
        if (PDMA_GET_ABORT_STS(PDMA) & (UART2_PDMA_OPENED_CH_RX))
        {
            printf("UART2_PDMA_OPENED_CH_RX\r\n");
            PDMA_CLR_ABORT_FLAG(PDMA, (UART2_PDMA_OPENED_CH_RX));
        }
        #endif
        
		#endif
    }
    else if (status & PDMA_INTSTS_TDIF_Msk)     /* done */
    {
        #if defined (ENABLE_UART1)            
        if (PDMA_GET_TD_STS(PDMA) & UART1_PDMA_OPENED_CH_RX)
        {
            PDMA_CLR_TD_FLAG(PDMA, UART1_PDMA_OPENED_CH_RX);

            /* Update receive count */
            UART1_P.g_u32comRbytes += UART1_P.g_u32cntbak + 1; /* count */
            UART1_P.g_u32comRtail = (UART1_P.g_u32comRtail + UART1_P.g_u32cntbak + 1) % RXBUFSIZE; /* index */
            UART1_P.g_u32cntbak = RXBUFSIZE / 2 - 1; /* channel cnt backup */

            UART1_P.g_u8PackageComplete = 1;

            QueueSingleInISR(xUARTQueue_scatter,0x55);  
        } 
        #endif

        #if defined (ENABLE_UART2) 
        if (PDMA_GET_TD_STS(PDMA) & UART2_PDMA_OPENED_CH_RX)
        {
            PDMA_CLR_TD_FLAG(PDMA, UART2_PDMA_OPENED_CH_RX);

            /* Update receive count */
            UART2_P.g_u32comRbytes += UART2_P.g_u32cntbak + 1; /* count */
            UART2_P.g_u32comRtail = (UART2_P.g_u32comRtail + UART2_P.g_u32cntbak + 1) % RXBUFSIZE; /* index */
            UART2_P.g_u32cntbak = RXBUFSIZE / 2 - 1; /* channel cnt backup */

            UART2_P.g_u8PackageComplete = 1;
        } 
        #endif

    }
    #if defined (ENABLE_UART1)     
    else if (status & (PDMA_INTSTS_REQTOF0_Msk))     /* Check the DMA time-out interrupt flag */
    {
        // printf("UART1_RX time-out !!\r\n");
        /* Update receive count */
        UART1_P.g_u32comRbytes += UART1_P.g_u32cntbak - UART1_P.cnt;  /* count */
        UART1_P.g_u32comRtail = (UART1_P.g_u32comRtail + UART1_P.g_u32cntbak - UART1_P.cnt) % RXBUFSIZE;  /* index */
        UART1_P.g_u32cntbak = UART1_P.cnt; /* channel cnt backup */

        UART1_P.g_u8PackageComplete = 0;

        #if 0 // debug
        printf("2)Rhead:%2d\r\n",UART1_P.g_u32comRhead); 
        printf("2)Rtail:%2d\r\n",UART1_P.g_u32comRtail);         
        printf("2)Rbytes:%2d\r\n",UART1_P.g_u32comRbytes); 
        #endif
        if ( (UART1_P.g_u32comRbytes + UART1_P.g_u32comRhead) > (RXBUFSIZE) )
        {
            if (( (UART1_P.g_u32comRbytes + UART1_P.g_u32comRhead) - RXBUFSIZE  ) == UART1_P.g_u32comRtail)
            {
                len = UART1_P.g_u32comRbytes - UART1_P.g_u32comRtail;
                StreamBufferInISR(xStreamBuffer_scatter, &UART1_P.g_u8RecData[UART1_P.g_u32comRhead], len);
                #if 0 // debug
                printf("2a)len : %2d\r\n",len);
                #endif

                len = UART1_P.g_u32comRtail;
                StreamBufferInISR(xStreamBuffer_scatter, &UART1_P.g_u8RecData[0], len);
                #if 0 // debug
                printf("2b)len : %2d\r\n",len);
                #endif
            }            
        }
        else
        {
            len = UART1_P.g_u32comRbytes + 0;            
            StreamBufferInISR(xStreamBuffer_scatter, &UART1_P.g_u8RecData[UART1_P.g_u32comRhead], len);
            #if 0 // debug
            printf("2c)len : %2d\r\n",len);
            #endif           
        }
        
        QueueSingleInISR(xUARTQueue_scatter,0x66);        

        /* restart timeout */
        PDMA_SetTimeOut(PDMA, UART1_RX_DMA_CH, DISABLE, 0);
        PDMA_CLR_TMOUT_FLAG(PDMA, UART1_RX_DMA_CH);
        PDMA_SetTimeOut(PDMA, UART1_RX_DMA_CH, ENABLE, PDMA_TIME);
        sRxCount++; 
    }
    #endif
    #if defined (ENABLE_UART2)     
    else if (status & (PDMA_INTSTS_REQTOF1_Msk))     /* Check the DMA time-out interrupt flag */
    {
        // printf("UART2_RX time-out !!\r\n");
        /* Update receive count */
        UART2_P.g_u32comRbytes += UART2_P.g_u32cntbak - UART2_P.cnt;  /* count */
        UART2_P.g_u32comRtail = (UART2_P.g_u32comRtail + UART2_P.g_u32cntbak - UART2_P.cnt) % RXBUFSIZE;  /* index */
        UART2_P.g_u32cntbak = UART2_P.cnt; /* channel cnt backup */

        UART2_P.g_u8PackageComplete = 0;

        /* restart timeout */
        PDMA_SetTimeOut(PDMA, UART2_RX_DMA_CH, DISABLE, 0);
        PDMA_CLR_TMOUT_FLAG(PDMA, UART2_RX_DMA_CH);
        PDMA_SetTimeOut(PDMA, UART2_RX_DMA_CH, ENABLE, PDMA_TIME);        
    }    
    #endif
    else
    {
        printf("unknown interrupt !!\r\n");
    }	
}


void PDMA_WriteUART2SGTable(void)  //scatter-gather table */
{
    DMA_UART2DESC[UART2_RX_BUFFER01].ctl = \
                      ((RXBUFSIZE / 2 - 1) << PDMA_DSCT_CTL_TXCNT_Pos) | /* Transfer count is RXBUFSIZE/2 */ \
                      PDMA_WIDTH_8 |    /* Transfer width is 8 bits */ \
                      PDMA_SAR_FIX |    /* Source increment size is  fixed(no increment) */ \
                      PDMA_DAR_INC |    /* Destination increment size is 8 bits */ \
                      PDMA_REQ_SINGLE | /* Transfer type is single transfer type */ \
                      PDMA_BURST_1 |    /* Burst size is 1. No effect in single transfer type */ \
                      PDMA_OP_SCATTER;  /* Operation mode is scatter-gather mode */
    /* Configure source address */
    DMA_UART2DESC[UART2_RX_BUFFER01].src = (uint32_t)UART2_BASE;
    /* Configure destination address */
    DMA_UART2DESC[UART2_RX_BUFFER01].dest = (uint32_t)&UART2_P.g_u8RecData[0];/*buffer 1 */
    /* Configure next descriptor table address */
    DMA_UART2DESC[UART2_RX_BUFFER01].offset = (uint32_t)&DMA_UART2DESC[UART2_RX_BUFFER02] - (PDMA->SCATBA); /* next operation table is table 2 */

    DMA_UART2DESC[UART2_RX_BUFFER02].ctl = \
                      ((RXBUFSIZE / 2 - 1) << PDMA_DSCT_CTL_TXCNT_Pos) | /* Transfer count is RXBUFSIZE/2 */ \
                      PDMA_WIDTH_8 |    /* Transfer width is 8 bits */ \
                      PDMA_SAR_FIX |    /* Source increment size is fixed(no increment) */ \
                      PDMA_DAR_INC |    /* Destination increment size is 8 bits */ \
                      PDMA_REQ_SINGLE | /* Transfer type is single transfer type */ \
                      PDMA_BURST_1 |    /* Burst size is 1. No effect in single transfer type */ \
                      PDMA_OP_SCATTER;  /* Operation mode is scatter-gather mode */
    /* Configure source address */
    DMA_UART2DESC[UART2_RX_BUFFER02].src = (uint32_t)UART2_BASE;
    /* Configure destination address */
    DMA_UART2DESC[UART2_RX_BUFFER02].dest = (uint32_t)&UART2_P.g_u8RecData[RXBUFSIZE / 2] ; /* buffer 2 */
    /* Configure next descriptor table address */
    DMA_UART2DESC[UART2_RX_BUFFER02].offset = (uint32_t)&DMA_UART2DESC[UART2_RX_BUFFER01] - (PDMA->SCATBA); /* next operation table is table 1 */

