released/M480BSP_FreeRTOS_Queue_UART_Rx/SampleCode/Template/main.c
}

void PDMA_WriteUART1SGTable(void)  //scatter-gather table */
{
    DMA_UART1DESC[UART1_RX_BUFFER01].ctl = \
                      ((RXBUFSIZE / 2 - 1) << PDMA_DSCT_CTL_TXCNT_Pos) | /* Transfer count is RXBUFSIZE/2 */ \
                      PDMA_WIDTH_8 |    /* Transfer width is 8 bits */ \
                      PDMA_SAR_FIX |    /* Source increment size is  fixed(no increment) */ \
                      PDMA_DAR_INC |    /* Destination increment size is 8 bits */ \
                      PDMA_REQ_SINGLE | /* Transfer type is single transfer type */ \
                      PDMA_BURST_1 |    /* Burst size is 1. No effect in single transfer type */ \
                      PDMA_OP_SCATTER;  /* Operation mode is scatter-gather mode */
    /* Configure source address */
    DMA_UART1DESC[UART1_RX_BUFFER01].src = (uint32_t)UART1_BASE;
    /* Configure destination address */
    DMA_UART1DESC[UART1_RX_BUFFER01].dest = (uint32_t)&UART1_P.g_u8RecData[0];/*buffer 1 */
    /* Configure next descriptor table address */
    DMA_UART1DESC[UART1_RX_BUFFER01].offset = (uint32_t)&DMA_UART1DESC[UART1_RX_BUFFER02] - (PDMA->SCATBA); /* next operation table is table 2 */

    DMA_UART1DESC[UART1_RX_BUFFER02].ctl = \
                      ((RXBUFSIZE / 2 - 1) << PDMA_DSCT_CTL_TXCNT_Pos) | /* Transfer count is RXBUFSIZE/2 */ \
                      PDMA_WIDTH_8 |    /* Transfer width is 8 bits */ \
                      PDMA_SAR_FIX |    /* Source increment size is fixed(no increment) */ \
                      PDMA_DAR_INC |    /* Destination increment size is 8 bits */ \
                      PDMA_REQ_SINGLE | /* Transfer type is single transfer type */ \
                      PDMA_BURST_1 |    /* Burst size is 1. No effect in single transfer type */ \
                      PDMA_OP_SCATTER;  /* Operation mode is scatter-gather mode */
    /* Configure source address */
    DMA_UART1DESC[UART1_RX_BUFFER02].src = (uint32_t)UART1_BASE;
    /* Configure destination address */
    DMA_UART1DESC[UART1_RX_BUFFER02].dest = (uint32_t)&UART1_P.g_u8RecData[RXBUFSIZE / 2] ; /* buffer 2 */
    /* Configure next descriptor table address */
    DMA_UART1DESC[UART1_RX_BUFFER02].offset = (uint32_t)&DMA_UART1DESC[UART1_RX_BUFFER01] - (PDMA->SCATBA); /* next operation table is table 1 */
}

void UART_PDMA_SCATTER_Init(void)
{

    SYS_ResetModule(PDMA_RST);
    
    #if defined (ENABLE_UART1)    
    PDMA_Open(PDMA, UART1_PDMA_OPENED_CH_RX);    
    PDMA_WriteUART1SGTable();
    PDMA_SetTransferMode(PDMA, UART1_RX_DMA_CH, PDMA_UART1_RX, TRUE, (uint32_t)&DMA_UART1DESC[UART1_RX_BUFFER01]);
    PDMA_SetTimeOut(PDMA,UART1_RX_DMA_CH, ENABLE, PDMA_TIME);
    PDMA_EnableInt(PDMA, UART1_RX_DMA_CH, PDMA_INT_TRANS_DONE);
    PDMA_EnableInt(PDMA, UART1_RX_DMA_CH, PDMA_INT_TIMEOUT);   
    #endif

    #if defined (ENABLE_UART2)
    PDMA_Open(PDMA, UART2_PDMA_OPENED_CH_RX);    
    PDMA_WriteUART2SGTable();
    PDMA_SetTransferMode(PDMA, UART2_RX_DMA_CH, PDMA_UART2_RX, TRUE, (uint32_t)&DMA_UART2DESC[UART2_RX_BUFFER01]);
    PDMA_SetTimeOut(PDMA,UART2_RX_DMA_CH, ENABLE, PDMA_TIME);    
    PDMA_EnableInt(PDMA, UART2_RX_DMA_CH, PDMA_INT_TRANS_DONE);
    PDMA_EnableInt(PDMA, UART2_RX_DMA_CH, PDMA_INT_TIMEOUT);
    #endif

    //
    // Note:
    //  If you will call xxxFromISR API from ISR, the peripheral's interrupt priority
    //  must bigger than 'configLIBRARY_MAX_SYSCALL_INTERRUPT_PRIORITY', or the API will
    //  block by the FreeRTOS kernel.
    //
    NVIC_SetPriority(PDMA_IRQn, 0x06);
    NVIC_EnableIRQ(PDMA_IRQn);
}
#endif

#if defined (ENABLE_PDMA_TIMEOUT)

void usart_rx_check(void) 
{
    static size_t old_pos;
    size_t pos;

    /* Calculate current position in buffer and check for new data available */
    pos = SIZEOF(UART1_RxBuffer) - PDMA_GET_TRANS_CNT(PDMA, UART1_RX_DMA_CH);
    if (pos != old_pos) {                       /* Check change in received data */
        if (pos > old_pos) {                    /* Current position is over previous one */
            /*
             * Processing is done in "linear" mode.
             *
             * Application processing is fast with single data block,
             * length is simply calculated by subtracting pointers
             *
             * [   0   ]
             * [   1   ] <- old_pos |------------------------------------|
             * [   2   ]            |                                    |
             * [   3   ]            | Single block (len = pos - old_pos) |
             * [   4   ]            |                                    |
             * [   5   ]            |------------------------------------|
             * [   6   ] <- pos
             * [   7   ]
             * [ N - 1 ]
             */
            dump_buffer(&UART1_RxBuffer[old_pos], pos - old_pos);
        } else {
            /*
             * Processing is done in "overflow" mode..
             *
             * Application must process data twice,
             * since there are 2 linear memory blocks to handle
             *
             * [   0   ]            |---------------------------------|
             * [   1   ]            | Second block (len = pos)        |
             * [   2   ]            |---------------------------------|
             * [   3   ] <- pos
             * [   4   ] <- old_pos |---------------------------------|
             * [   5   ]            |                                 |
             * [   6   ]            | First block (len = N - old_pos) |
             * [   7   ]            |                                 |
             * [ N - 1 ]            |---------------------------------|
             */
            dump_buffer(&UART1_RxBuffer[old_pos], SIZEOF(UART1_RxBuffer) - old_pos);
            if (pos > 0) {
                dump_buffer(&UART1_RxBuffer[0], pos);
            }
        }
        old_pos = pos;                          /* Save current position as old for next transfers */
    }
}

void UART2_RX_PDMA_set(void)
{
    //RX	
    PDMA_SetTransferCnt(PDMA,UART2_RX_DMA_CH, PDMA_WIDTH_8, RXBUFSIZE);
    PDMA_SetTransferAddr(PDMA,UART2_RX_DMA_CH, UART2_BASE, PDMA_SAR_FIX, ((uint32_t) (&UART2_RxBuffer[0])), PDMA_DAR_INC);	
    /* Set request source; set basic mode. */
    PDMA_SetTransferMode(PDMA,UART2_RX_DMA_CH, PDMA_UART2_RX, FALSE, 0);
      
