released/M480BSP_FreeRTOS_Queue_UART_Rx/SampleCode/Template/main.c
}

void UART1_RX_PDMA_set(void)
{
    //RX	
    PDMA_SetTransferCnt(PDMA,UART1_RX_DMA_CH, PDMA_WIDTH_8, RXBUFSIZE);
    PDMA_SetTransferAddr(PDMA,UART1_RX_DMA_CH, UART1_BASE, PDMA_SAR_FIX, ((uint32_t) (&UART1_RxBuffer[0])), PDMA_DAR_INC);	
    /* Set request source; set basic mode. */
    PDMA_SetTransferMode(PDMA,UART1_RX_DMA_CH, PDMA_UART1_RX, FALSE, 0);
     
}

void PDMA_TIMEOUT_IRQHandler(void)
{
    uint32_t status = PDMA_GET_INT_STATUS(PDMA);    

    if (status & PDMA_INTSTS_ABTIF_Msk)   /* abort */
    {
        printf("target abort interrupt !!:\r\n");
		#if 0
        PDMA_CLR_ABORT_FLAG(PDMA, PDMA_GET_ABORT_STS(PDMA));
		#else

        #if defined (ENABLE_UART1)            
        if (PDMA_GET_ABORT_STS(PDMA) & (UART1_PDMA_OPENED_CH_RX))
        {
            printf("UART1_PDMA_OPENED_CH_RX\r\n");
            PDMA_CLR_ABORT_FLAG(PDMA, (UART1_PDMA_OPENED_CH_RX));
        }
        #endif
        
        #if defined (ENABLE_UART2) 
        if (PDMA_GET_ABORT_STS(PDMA) & (UART2_PDMA_OPENED_CH_RX))
        {
            printf("UART2_PDMA_OPENED_CH_RX\r\n");
            PDMA_CLR_ABORT_FLAG(PDMA, (UART2_PDMA_OPENED_CH_RX));
        }
        #endif
        
		#endif
    }
    else if (status & PDMA_INTSTS_TDIF_Msk)     /* done */
    {
		#if 1

        #if defined (ENABLE_UART1)            
        if (PDMA_GET_TD_STS(PDMA) & UART1_PDMA_OPENED_CH_RX)
        {
            PDMA_CLR_TD_FLAG(PDMA, UART1_PDMA_OPENED_CH_RX);
        } 
        #endif

        #if defined (ENABLE_UART2) 
        if (PDMA_GET_TD_STS(PDMA) & UART2_PDMA_OPENED_CH_RX)
        {
            PDMA_CLR_TD_FLAG(PDMA, UART2_PDMA_OPENED_CH_RX);
        } 
        #endif
		
		#else
        if((PDMA_GET_TD_STS(PDMA) & UART_PDMA_OPENED_CH) == UART_PDMA_OPENED_CH)
        {
            /* Clear PDMA transfer done interrupt flag */
            PDMA_CLR_TD_FLAG(PDMA, UART_PDMA_OPENED_CH);
			//insert process
			/*
                DISABLE TRIGGER
            */

        } 
		#endif
    }
    #if defined (ENABLE_UART1)     
    else if (status & (PDMA_INTSTS_REQTOF0_Msk))     /* Check the DMA time-out interrupt flag */
    {
        // printf("UART1_RX time-out !!\r\n");
        /* Update receive count */

        StreamBufferInISR(xStreamBuffer_timeout,UART1_RxBuffer,RXBUFSIZE);
        QueueSingleInISR(xUARTQueue_timeout,0xA5);
    
        // PDMA_SET_TRANS_CNT(PDMA, UART1_RX_DMA_CH,1); 
        /* restart timeout */
        PDMA_SetTimeOut(PDMA, UART1_RX_DMA_CH, DISABLE, 0);
        PDMA_CLR_TMOUT_FLAG(PDMA, UART1_RX_DMA_CH);
        PDMA_SetTimeOut(PDMA, UART1_RX_DMA_CH, ENABLE, PDMA_TIME);    
        set_flag(flag_UART1_RX_end,ENABLE);
        sRxCount++;       
    }
    #endif
    #if defined (ENABLE_UART2)     
    else if (status & (PDMA_INTSTS_REQTOF1_Msk))     /* Check the DMA time-out interrupt flag */
    {
        // printf("UART2_RX time-out !!\r\n");
        /* Update receive count */
        
        // PDMA_SET_TRANS_CNT(PDMA, UART2_RX_DMA_CH,1);    
        /* restart timeout */
        PDMA_SetTimeOut(PDMA, UART2_RX_DMA_CH, DISABLE, 0);
        PDMA_CLR_TMOUT_FLAG(PDMA, UART2_RX_DMA_CH);
        PDMA_SetTimeOut(PDMA, UART2_RX_DMA_CH, ENABLE, PDMA_TIME);    
        set_flag(flag_UART2_RX_end,ENABLE);          
    }    
    #endif    
    else
    {
        printf("unknown interrupt !!\r\n");
    }	

    // portEND_SWITCHING_ISR( xHigherPriorityTaskWoken ); 

}

void UART_PDMA_TIMEOUT_Init(void)
{

	set_flag(flag_UART1_RX_end,DISABLE);
	set_flag(flag_UART2_RX_end,DISABLE);

    SYS_ResetModule(PDMA_RST);

    #if defined (ENABLE_UART1)    
    PDMA_Open(PDMA, UART1_PDMA_OPENED_CH_RX);

    PDMA_SetTransferCnt(PDMA,UART1_RX_DMA_CH, PDMA_WIDTH_8, RXBUFSIZE);
    /* Set source/destination address and attributes */
    PDMA_SetTransferAddr(PDMA,UART1_RX_DMA_CH, UART1_BASE, PDMA_SAR_FIX, ((uint32_t) (&UART1_RxBuffer[0])), PDMA_DAR_INC);

    /* Set request source; set basic mode. */
    PDMA_SetTransferMode(PDMA,UART1_RX_DMA_CH, PDMA_UART1_RX, FALSE, 0);
    /* Single request type. */
    PDMA_SetBurstType(PDMA,UART1_RX_DMA_CH, PDMA_REQ_SINGLE, 0);
    /* Disable table interrupt */
    PDMA_DisableInt(PDMA,UART1_RX_DMA_CH, PDMA_INT_TEMPTY );//PDMA->DSCT[UART1_RX_DMA_CH].CTL |= PDMA_DSCT_CTL_TBINTDIS_Msk;  

    PDMA_EnableInt(PDMA, UART1_RX_DMA_CH, PDMA_INT_TRANS_DONE);
    PDMA_EnableInt(PDMA, UART1_RX_DMA_CH, PDMA_INT_TIMEOUT);

    // PDMA->TOUTPSC = (PDMA->TOUTPSC & (~PDMA_TOUTPSC_TOUTPSC0_Msk)) | (0x5 << PDMA_TOUTPSC_TOUTPSC0_Pos);
    PDMA_SetTimeOut(PDMA,UART1_RX_DMA_CH, ENABLE, PDMA_TIME );

    #endif

    #if defined (ENABLE_UART2)     
    PDMA_Open(PDMA, UART2_PDMA_OPENED_CH_RX);

    PDMA_SetTransferCnt(PDMA,UART2_RX_DMA_CH, PDMA_WIDTH_8, RXBUFSIZE);
    /* Set source/destination address and attributes */
    PDMA_SetTransferAddr(PDMA,UART2_RX_DMA_CH, UART2_BASE, PDMA_SAR_FIX, ((uint32_t) (&UART2_RxBuffer[0])), PDMA_DAR_INC);
    /* Set request source; set basic mode. */
    PDMA_SetTransferMode(PDMA,UART2_RX_DMA_CH, PDMA_UART2_RX, FALSE, 0);
    /* Single request type. */
    PDMA_SetBurstType(PDMA,UART2_RX_DMA_CH, PDMA_REQ_SINGLE, 0);
    /* Disable table interrupt */
    PDMA_DisableInt(PDMA,UART2_RX_DMA_CH, PDMA_INT_TEMPTY );//PDMA->DSCT[UART2_RX_DMA_CH].CTL |= PDMA_DSCT_CTL_TBINTDIS_Msk;  

    PDMA_EnableInt(PDMA, UART2_RX_DMA_CH, PDMA_INT_TRANS_DONE);
    PDMA_EnableInt(PDMA, UART2_RX_DMA_CH, PDMA_INT_TIMEOUT); 

    // PDMA->TOUTPSC = (PDMA->TOUTPSC & (~PDMA_TOUTPSC_TOUTPSC1_Msk)) | (0x5 << PDMA_TOUTPSC_TOUTPSC1_Pos);
    PDMA_SetTimeOut(PDMA,UART2_RX_DMA_CH, ENABLE, PDMA_TIME );     
    #endif
    
     /*
        UART data freq : 1.6KHz	0.625	ms

        Set PDMA CH 0/1 timeout to about 
        2 ms (5/(72M/(2^15)))
        0.56 ms (5/(72M/(2^13)))

        target (ms)	    u32TimeOutCnt	clk div	    prescale	
        2.275555556	    5	            72000000	32768	15      111
        1.137777778	    5	            72000000	16384	14      110
        0.568888889	    5	            72000000	8192	13      101
        0.284444444	    5	            72000000	4096	12      100
        0.142222222	    5	            72000000	2048	11      011
        0.071111111	    5	            72000000	1024	10      010
        0.035555556	    5	            72000000	512	    9       001
        0.017777778	    5	            72000000	256	    8       000  

    */

    //
    // Note:
    //  If you will call xxxFromISR API from ISR, the peripheral's interrupt priority
    //  must bigger than 'configLIBRARY_MAX_SYSCALL_INTERRUPT_PRIORITY', or the API will
    //  block by the FreeRTOS kernel.
    //
    NVIC_SetPriority(PDMA_IRQn, 0x06);
    NVIC_EnableIRQ(PDMA_IRQn);
}
#endif

