released/M480BSP_FreeRTOS_Queue_UART_Rx/SampleCode/Template/main.c
    #if defined (ENABLE_PDMA_TIMEOUT)
	xUARTQueue_timeout = xQueueCreate( 10 , sizeof( unsigned char ) );
    xStreamBuffer_timeout = xStreamBufferCreate( RXBUFSIZE, RXBUFSIZE/2 );

    UART_PDMA_TIMEOUT_Init();

    #elif defined (ENABLE_PDMA_SCATTER)
	xUARTQueue_scatter = xQueueCreate( RXBUFSIZE , sizeof( unsigned char ) );
    xStreamBuffer_scatter = xStreamBufferCreate( RXBUFSIZE, RXBUFSIZE/2 );

    UART_PDMA_SCATTER_Init();
    #endif

    UART1_UART2_Init();

    printf("%s is running ...\r\n",__FUNCTION__);

	(void) pvParameters;
	for( ;; )
	{ 
        PH2 ^= 1;

        #if defined (ENABLE_PDMA_TIMEOUT)    
        if ( xQueueReceive(xUARTQueue_timeout, &xData, ( ( TickType_t ) 1 / portTICK_PERIOD_MS ) ))   
        {
            printf("\r\nread Queue : 0x%2X\r\n", xData);
            if ( xStreamBufferReceive(xStreamBuffer_timeout, &xDataStreamBuffer, RXBUFSIZE,( ( TickType_t ) 1 / portTICK_PERIOD_MS ) ))   
            {
                printf("StreamBuffer ready(timeout)\r\n");
            } 

            if (is_flag_set(flag_UART1_RX_end))
            {
                set_flag(flag_UART1_RX_end, DISABLE);

                printf("UART1_RxBuffer : \r\n");
                // dump_buffer(UART1_RxBuffer, RXBUFSIZE);
                dump_buffer_hex(UART1_RxBuffer, RXBUFSIZE); 
                reset_buffer(UART1_RxBuffer,0x00,RXBUFSIZE); 
                
                printf("xDataStreamBuffer : \r\n");
                // dump_buffer(xDataStreamBuffer, RXBUFSIZE);
                dump_buffer_hex(xDataStreamBuffer, RXBUFSIZE); 
                reset_buffer(xDataStreamBuffer,0x00,RXBUFSIZE);  
                           
                UART1_RX_PDMA_set();        
            }

            if (is_flag_set(flag_UART2_RX_end))
            {
                set_flag(flag_UART2_RX_end, DISABLE);

                printf("UART2_RxBuffer : \r\n");
                dump_buffer(UART2_RxBuffer, RXBUFSIZE);
                reset_buffer(UART2_RxBuffer,0x00,RXBUFSIZE);  

                UART2_RX_PDMA_set();   
            }
        }

        #endif

        #if defined (ENABLE_PDMA_SCATTER)
        if ( xQueueReceive(xUARTQueue_scatter, &xData, ( ( TickType_t ) 5 / portTICK_PERIOD_MS ) ))   
        {
            printf("\r\nread Queue : 0x%2X\r\n",xData);

            if (xData == 0x66)
            {
                if ( xStreamBufferReceive(xStreamBuffer_scatter, &xDataStreamBuffer, RXBUFSIZE,( ( TickType_t ) 1 / portTICK_PERIOD_MS ) ))   
                {
                    printf("StreamBuffer ready(scatter)\r\n");
                    
                    printf("xDataStreamBuffer : \r\n");
                    // dump_buffer(xDataStreamBuffer, RXBUFSIZE);
                    dump_buffer_hex(xDataStreamBuffer, RXBUFSIZE); 
                    reset_buffer(xDataStreamBuffer,0x00,RXBUFSIZE);                              
                }    
            }         
        }

        #if defined (ENABLE_UART1)     
        if (UART1_P.g_u32comRbytes)
        {        
            UART1_P.tmp = UART1_P.g_u32comRtail;

            if (UART1_P.g_u32comRhead != UART1_P.tmp)
            {
                printf("UART1:%c[0x%2X](Rbytes:%2d,Rhead:%2d,Rtail:%2d)\r\n", 
                UART1_P.g_u8RecData[UART1_P.g_u32comRhead],
                UART1_P.g_u8RecData[UART1_P.g_u32comRhead],            
                UART1_P.g_u32comRbytes,
                UART1_P.g_u32comRhead,
                UART1_P.g_u32comRtail);

                UART1_P.g_u32comRhead = (UART1_P.g_u32comRhead == (RXBUFSIZE - 1)) ? 0 : (UART1_P.g_u32comRhead + 1);
                UART1_P.g_u32comRbytes--;
            }
        }
        #endif

        #if defined (ENABLE_UART2) 
        if (UART2_P.g_u32comRbytes)
        {        
            UART2_P.tmp = UART2_P.g_u32comRtail;

            if (UART2_P.g_u32comRhead != UART2_P.tmp)
            {
                printf("UART2:%c[0x%2X](Rbytes:%2d,Rhead:%2d,Rtail:%2d)\r\n", 
                UART2_P.g_u8RecData[UART2_P.g_u32comRhead],
                UART2_P.g_u8RecData[UART2_P.g_u32comRhead],            
                UART2_P.g_u32comRbytes,
                UART2_P.g_u32comRhead,
                UART2_P.g_u32comRtail);            
                
                UART2_P.g_u32comRhead = (UART2_P.g_u32comRhead == (RXBUFSIZE - 1)) ? 0 : (UART2_P.g_u32comRhead + 1);
                UART2_P.g_u32comRbytes--;
            }
        }
        #endif   

        #endif

        /* Add data processing code */

	}  
}

void vTask_logger( void *pvParameters )
{	
 	// static uint32_t cnt = 0;   
	uint32_t millisec = DELAY_MS*1000;
	portTickType xLastWakeTime;

	xLastWakeTime = xTaskGetTickCount();

    printf("%s is running ...\r\n",__FUNCTION__);

	(void) pvParameters;
	for( ;; )
	{
        vTaskDelayUntil( &xLastWakeTime, ( ( portTickType ) millisec / portTICK_RATE_MS));
        
        #if 0 // debug
        printf("Task logger :%4d (heap:%3dbytes ,CPU:%3d)\r\n" ,cnt++,xPortGetFreeHeapSize(),osGetCPUUsage());
        #endif
		
        PH1 ^= 1;
	}  
}

void vTask_check( void *pvParameters )
{	
    static uint32_t timecount = 0;
	uint32_t millisec = DELAY_MS*5000;
    uint32_t res = 0;

	portTickType xLastWakeTime;
	xLastWakeTime = xTaskGetTickCount();

    timecount = get_tick();

    printf("%s is running ...\r\n",__FUNCTION__);

	(void) pvParameters;
	for( ;; )
	{
        vTaskDelayUntil( &xLastWakeTime, ( ( portTickType ) millisec / portTICK_RATE_MS));
        res = get_tick();
        if( xAreTaskUartStillRunning() != pdTRUE )
        {
            #if 0 // debug
            printf( "ERROR IN TaskUart (prev:%5d,current:%5d,diff:%5d)\r\n" , timecount , res , res-timecount);
            timecount = get_tick();
            #endif            
        }
	}  
}



/*
 * This is a template project for M480 series MCU. Users could based on this project to create their
 * own application without worry about the IAR/Keil project settings.
 *
 * This template application uses external crystal as HCLK source and configures UART0 to print out
 * "Hello World", users may need to do extra system configuration based on their system design.
 */

int main()
{
    SYS_Init();

	UART0_Init();
	Custom_Init();	
	TIMER1_Init();

    xTaskCreate(vTask_check     ,"check"    ,configMINIMAL_STACK_SIZE   ,NULL   ,mainCHECK_TASK_PRIORITY        ,NULL);
    xTaskCreate(vTask_logger    ,"logger"   ,configMINIMAL_STACK_SIZE   ,NULL	,mainNORMAL_TASK_PRIORITY       ,NULL);
    xTaskCreate(vTask_uart      ,"uart"     ,configMINIMAL_STACK_SIZE*2 ,NULL	,mainNORMAL_TASK_PRIORITY       ,NULL);

    vTaskStartScheduler();

    for( ;; );
}

/*** (C) COPYRIGHT 2016 Nuvoton Technology Corp. ***/
